avrxml/AS6-Devices-XML/ATSAM3X4E.xml
        <module name="UART" id="UART" version="6418E">
          <instance name="UART">
            <register-group address-space="base" name="UART" name-in-module="UART" offset="0x400E0800"/>
            <signals>
              <signal pad="PA8" function="A" group="URXD"/>
              <signal pad="PA9" function="A" group="UTXD"/>
            </signals>
          </instance>
        </module>
        <module name="UOTGHS" id="UOTGHS" version="11016B">
          <instance name="UOTGHS">
            <register-group address-space="base" name="UOTGHS" name-in-module="UOTGHS" offset="0x400AC000"/>
            <signals>
              <signal pad="PB11" function="A" group="UOTGID"/>
              <signal pad="PB10" function="A" group="UOTGVBOF"/>
            </signals>
          </instance>
        </module>
        <module name="USART" id="USART" version="6089W">
          <instance name="USART0">
            <register-group address-space="base" name="USART0" name-in-module="USART" offset="0x40098000"/>
            <signals>
              <signal pad="PB26" function="A" group="CTS" index="0"/>
              <signal pad="PB25" function="A" group="RTS" index="0"/>
              <signal pad="PA10" function="A" group="RXD" index="0"/>
              <signal pad="PA17" function="B" group="SCK" index="0"/>
              <signal pad="PA11" function="A" group="TXD" index="0"/>
            </signals>
          </instance>
          <instance name="USART1">
            <register-group address-space="base" name="USART1" name-in-module="USART" offset="0x4009C000"/>
            <signals>
              <signal pad="PA15" function="A" group="CTS" index="1"/>
              <signal pad="PA14" function="A" group="RTS" index="1"/>
              <signal pad="PA12" function="A" group="RXD" index="1"/>
              <signal pad="PA16" function="A" group="SCK" index="1"/>
              <signal pad="PA13" function="A" group="TXD" index="1"/>
            </signals>
          </instance>
          <instance name="USART2">
            <register-group address-space="base" name="USART2" name-in-module="USART" offset="0x400A0000"/>
            <signals>
              <signal pad="PB23" function="A" group="CTS" index="2"/>
              <signal pad="PB22" function="A" group="RTS" index="2"/>
              <signal pad="PB21" function="A" group="RXD" index="2"/>
              <signal pad="PB24" function="A" group="SCK" index="2"/>
              <signal pad="PB20" function="A" group="TXD" index="2"/>
            </signals>
          </instance>
          <instance name="USART3">
            <register-group address-space="base" name="USART3" name-in-module="USART" offset="0x400A4000"/>
            <signals>
              <signal pad="PF4" function="A" group="CTS" index="3"/>
              <signal pad="PF5" function="A" group="RTS" index="3"/>
              <signal pad="PD5" function="B" group="RXD" index="3"/>
              <signal pad="PE16" function="B" group="SCK" index="3"/>
              <signal pad="PD4" function="B" group="TXD" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="WDT" id="WDT" version="6080B">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1A50"/>
          </instance>
        </module>
      <module name="FUSES" id="FUSES">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" id="LOCKBIT">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
      <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
          </instance>
        </module>
        <module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module>
        <module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module>
      </peripherals>
      
      
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
      <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B2B03F"/>
          <property name="CHIPID_CIDR" value="0x285B0960"/>
          <property name="CHIPID_EXID" value="0x0"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module caption="Analog-to-digital Converter" name="ADC" version="6489I">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN" values="ADC_MR__TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="ADC_MR__TRGSEL"/>
          <bitfield caption="Resolution" mask="0x00000010" name="LOWRES" values="ADC_MR__LOWRES"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="ADC_MR__SLEEP"/>
          <bitfield caption="Fast Wake Up" mask="0x00000040" name="FWUP" values="ADC_MR__FWUP"/>
          <bitfield caption="Free Run Mode" mask="0x00000080" name="FREERUN" values="ADC_MR__FREERUN"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Start Up Time" mask="0x000F0000" name="STARTUP" values="ADC_MR__STARTUP"/>
          <bitfield caption="Analog Settling Time" mask="0x00300000" name="SETTLING" values="ADC_MR__SETTLING"/>
          <bitfield caption="Analog Change" mask="0x00800000" name="ANACH" values="ADC_MR__ANACH"/>
          <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
          <bitfield caption="Transfer Period" mask="0x30000000" name="TRANSFER"/>
          <bitfield caption="Use Sequence Enable" mask="0x80000000" name="USEQ" values="ADC_MR__USEQ"/>
        </register>
