avrxml/AS6-Devices-XML/ATSAM3X4E.xml
        <register caption="Mailbox Acceptance Mask Register (MB = 1)" name="CAN_MAM1" offset="0x224" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
        <register caption="Mailbox ID Register (MB = 1)" name="CAN_MID1" offset="0x228" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
        <register caption="Mailbox Family ID Register (MB = 1)" name="CAN_MFID1" offset="0x22C" rw="R" size="4">
          <bitfield caption="Family ID" mask="0x1FFFFFFF" name="MFID"/>
        </register>
        <register caption="Mailbox Status Register (MB = 1)" name="CAN_MSR1" offset="0x230" rw="R" size="4">
          <bitfield caption="Timer value" mask="0x0000FFFF" name="MTIMESTAMP"/>
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Mailbox Message Abort" mask="0x00400000" name="MABT"/>
          <bitfield caption="Mailbox Ready" mask="0x00800000" name="MRDY"/>
          <bitfield caption="Mailbox Message Ignored" mask="0x01000000" name="MMI"/>
        </register>
        <register caption="Mailbox Data Low Register (MB = 1)" name="CAN_MDL1" offset="0x234" rw="RW" size="4">
          <bitfield caption="Message Data Low Value" mask="0xFFFFFFFF" name="MDL"/>
        </register>
        <register caption="Mailbox Data High Register (MB = 1)" name="CAN_MDH1" offset="0x238" rw="RW" size="4">
          <bitfield caption="Message Data High Value" mask="0xFFFFFFFF" name="MDH"/>
        </register>
        <register caption="Mailbox Control Register (MB = 1)" name="CAN_MCR1" offset="0x23C" rw="W" size="4">
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Abort Request for Mailbox x" mask="0x00400000" name="MACR"/>
          <bitfield caption="Mailbox Transfer Command" mask="0x00800000" name="MTCR"/>
        </register>
        <register caption="Mailbox Mode Register (MB = 2)" name="CAN_MMR2" offset="0x240" rw="RW" size="4">
          <bitfield caption="Mailbox Timemark" mask="0x0000FFFF" name="MTIMEMARK"/>
          <bitfield caption="Mailbox Priority" mask="0x000F0000" name="PRIOR"/>
          <bitfield caption="Mailbox Object Type" mask="0x07000000" name="MOT" values="CAN_MMR2__MOT"/>
        </register>
        <register caption="Mailbox Acceptance Mask Register (MB = 2)" name="CAN_MAM2" offset="0x244" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
        <register caption="Mailbox ID Register (MB = 2)" name="CAN_MID2" offset="0x248" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
        <register caption="Mailbox Family ID Register (MB = 2)" name="CAN_MFID2" offset="0x24C" rw="R" size="4">
          <bitfield caption="Family ID" mask="0x1FFFFFFF" name="MFID"/>
        </register>
        <register caption="Mailbox Status Register (MB = 2)" name="CAN_MSR2" offset="0x250" rw="R" size="4">
          <bitfield caption="Timer value" mask="0x0000FFFF" name="MTIMESTAMP"/>
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Mailbox Message Abort" mask="0x00400000" name="MABT"/>
          <bitfield caption="Mailbox Ready" mask="0x00800000" name="MRDY"/>
          <bitfield caption="Mailbox Message Ignored" mask="0x01000000" name="MMI"/>
        </register>
        <register caption="Mailbox Data Low Register (MB = 2)" name="CAN_MDL2" offset="0x254" rw="RW" size="4">
          <bitfield caption="Message Data Low Value" mask="0xFFFFFFFF" name="MDL"/>
        </register>
        <register caption="Mailbox Data High Register (MB = 2)" name="CAN_MDH2" offset="0x258" rw="RW" size="4">
          <bitfield caption="Message Data High Value" mask="0xFFFFFFFF" name="MDH"/>
        </register>
        <register caption="Mailbox Control Register (MB = 2)" name="CAN_MCR2" offset="0x25C" rw="W" size="4">
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Abort Request for Mailbox x" mask="0x00400000" name="MACR"/>
          <bitfield caption="Mailbox Transfer Command" mask="0x00800000" name="MTCR"/>
        </register>
        <register caption="Mailbox Mode Register (MB = 3)" name="CAN_MMR3" offset="0x260" rw="RW" size="4">
          <bitfield caption="Mailbox Timemark" mask="0x0000FFFF" name="MTIMEMARK"/>
          <bitfield caption="Mailbox Priority" mask="0x000F0000" name="PRIOR"/>
          <bitfield caption="Mailbox Object Type" mask="0x07000000" name="MOT" values="CAN_MMR3__MOT"/>
        </register>
