avrxml/AS6-Devices-XML/ATSAM3X4E.xml
        <register caption="System Clock Status Register" name="PMC_SCSR" offset="0x0008" rw="R" size="4">
          <bitfield caption="USB OTG Clock (48 MHz, USB_48M) Clock Status" mask="0x00000020" name="UOTGCLK"/>
          <bitfield caption="Programmable Clock 0 Output Status" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Status" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Status" mask="0x00000400" name="PCK2"/>
        </register>
        <register caption="Peripheral Clock Enable Register 0" name="PMC_PCER0" offset="0x0010" rw="W" size="4">
          <bitfield caption="Peripheral Clock 2 Enable" mask="0x00000004" name="PID2"/>
          <bitfield caption="Peripheral Clock 3 Enable" mask="0x00000008" name="PID3"/>
          <bitfield caption="Peripheral Clock 4 Enable" mask="0x00000010" name="PID4"/>
          <bitfield caption="Peripheral Clock 5 Enable" mask="0x00000020" name="PID5"/>
          <bitfield caption="Peripheral Clock 6 Enable" mask="0x00000040" name="PID6"/>
          <bitfield caption="Peripheral Clock 7 Enable" mask="0x00000080" name="PID7"/>
          <bitfield caption="Peripheral Clock 8 Enable" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral Clock 9 Enable" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral Clock 10 Enable" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral Clock 11 Enable" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral Clock 12 Enable" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral Clock 13 Enable" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral Clock 14 Enable" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral Clock 15 Enable" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral Clock 16 Enable" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral Clock 17 Enable" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral Clock 18 Enable" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral Clock 19 Enable" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral Clock 20 Enable" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral Clock 21 Enable" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral Clock 22 Enable" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral Clock 23 Enable" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral Clock 24 Enable" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral Clock 25 Enable" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral Clock 26 Enable" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral Clock 27 Enable" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral Clock 28 Enable" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral Clock 29 Enable" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral Clock 30 Enable" mask="0x40000000" name="PID30"/>
          <bitfield caption="Peripheral Clock 31 Enable" mask="0x80000000" name="PID31"/>
        </register>
        <register caption="Peripheral Clock Disable Register 0" name="PMC_PCDR0" offset="0x0014" rw="W" size="4">
          <bitfield caption="Peripheral Clock 2 Disable" mask="0x00000004" name="PID2"/>
          <bitfield caption="Peripheral Clock 3 Disable" mask="0x00000008" name="PID3"/>
          <bitfield caption="Peripheral Clock 4 Disable" mask="0x00000010" name="PID4"/>
          <bitfield caption="Peripheral Clock 5 Disable" mask="0x00000020" name="PID5"/>
          <bitfield caption="Peripheral Clock 6 Disable" mask="0x00000040" name="PID6"/>
          <bitfield caption="Peripheral Clock 7 Disable" mask="0x00000080" name="PID7"/>
          <bitfield caption="Peripheral Clock 8 Disable" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral Clock 9 Disable" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral Clock 10 Disable" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral Clock 11 Disable" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral Clock 12 Disable" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral Clock 13 Disable" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral Clock 14 Disable" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral Clock 15 Disable" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral Clock 16 Disable" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral Clock 17 Disable" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral Clock 18 Disable" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral Clock 19 Disable" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral Clock 20 Disable" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral Clock 21 Disable" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral Clock 22 Disable" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral Clock 23 Disable" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral Clock 24 Disable" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral Clock 25 Disable" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral Clock 26 Disable" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral Clock 27 Disable" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral Clock 28 Disable" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral Clock 29 Disable" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral Clock 30 Disable" mask="0x40000000" name="PID30"/>
          <bitfield caption="Peripheral Clock 31 Disable" mask="0x80000000" name="PID31"/>
        </register>
