avrxml/AS6-Devices-XML/ATSAM3X4E.xml
        <register caption="Interrupt Mask Register" name="UART_IMR" offset="0x0010" rw="R" size="4">
          <bitfield caption="Mask RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Mask End of Receive Transfer Interrupt" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Mask End of Transmit Interrupt" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Mask Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Mask Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Mask Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Mask TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Mask TXBUFE Interrupt" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Mask RXBUFF Interrupt" mask="0x00001000" name="RXBUFF"/>
        </register>
        <register caption="Status Register" name="UART_SR" offset="0x0014" rw="R" size="4">
          <bitfield caption="Receiver Ready" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="End of Receiver Transfer" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmitter Transfer" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error" mask="0x00000080" name="PARE"/>
          <bitfield caption="Transmitter Empty" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Transmission Buffer Empty" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Receive Buffer Full" mask="0x00001000" name="RXBUFF"/>
        </register>
        <register caption="Receive Holding Register" name="UART_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000000FF" name="RXCHR"/>
        </register>
        <register caption="Transmit Holding Register" name="UART_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000000FF" name="TXCHR"/>
        </register>
        <register caption="Baud Rate Generator Register" name="UART_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divisor" mask="0x0000FFFF" name="CD"/>
        </register>
        <register caption="Receive Pointer Register" name="UART_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="UART_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="UART_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="UART_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="UART_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="UART_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="UART_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="UART_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="UART_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="UART_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="UART_MR__PAR">
        <value caption="Even parity" name="EVEN" value="0x0"/>
        <value caption="Odd parity" name="ODD" value="0x1"/>
        <value caption="Space: parity forced to 0" name="SPACE" value="0x2"/>
        <value caption="Mark: parity forced to 1" name="MARK" value="0x3"/>
        <value caption="No parity" name="NO" value="0x4"/>
      </value-group>
      <value-group caption="" name="UART_MR__CHMODE">
        <value caption="Normal Mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic Echo" name="AUTOMATIC" value="0x1"/>
        <value caption="Local Loopback" name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote Loopback" name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
    </module>
    <module caption="USB On-The-Go Interface" name="UOTGHS" version="11016B">
      <register-group name="UOTGHS">
        <register caption="Device General Control Register" name="UOTGHS_DEVCTRL" offset="0x0000" rw="RW" size="4">
          <bitfield caption="USB Address" mask="0x0000007F" name="UADD"/>
          <bitfield caption="Address Enable" mask="0x00000080" name="ADDEN"/>
          <bitfield caption="Detach" mask="0x00000100" name="DETACH"/>
          <bitfield caption="Remote Wake-Up" mask="0x00000200" name="RMWKUP"/>
          <bitfield caption="Mode Configuration" mask="0x00000C00" name="SPDCONF" values="UOTGHS_DEVCTRL__SPDCONF"/>
          <bitfield caption="Low-Speed Mode Force" mask="0x00001000" name="LS"/>
          <bitfield caption="Test mode J" mask="0x00002000" name="TSTJ"/>
          <bitfield caption="Test mode K" mask="0x00004000" name="TSTK"/>
          <bitfield caption="Test packet mode" mask="0x00008000" name="TSTPCKT"/>
          <bitfield caption="Specific Operational mode" mask="0x00010000" name="OPMODE2"/>
        </register>
        <register caption="Device Global Interrupt Status Register" name="UOTGHS_DEVISR" offset="0x0004" rw="R" size="4">
          <bitfield caption="Suspend Interrupt" mask="0x00000001" name="SUSP"/>
          <bitfield caption="Micro Start of Frame Interrupt" mask="0x00000002" name="MSOF"/>
          <bitfield caption="Start of Frame Interrupt" mask="0x00000004" name="SOF"/>
          <bitfield caption="End of Reset Interrupt" mask="0x00000008" name="EORST"/>
          <bitfield caption="Wake-Up Interrupt" mask="0x00000010" name="WAKEUP"/>
          <bitfield caption="End of Resume Interrupt" mask="0x00000020" name="EORSM"/>
          <bitfield caption="Upstream Resume Interrupt" mask="0x00000040" name="UPRSM"/>
          <bitfield caption="Endpoint 0 Interrupt" mask="0x00001000" name="PEP_0"/>
          <bitfield caption="Endpoint 1 Interrupt" mask="0x00002000" name="PEP_1"/>
          <bitfield caption="Endpoint 2 Interrupt" mask="0x00004000" name="PEP_2"/>
          <bitfield caption="Endpoint 3 Interrupt" mask="0x00008000" name="PEP_3"/>
          <bitfield caption="Endpoint 4 Interrupt" mask="0x00010000" name="PEP_4"/>
          <bitfield caption="Endpoint 5 Interrupt" mask="0x00020000" name="PEP_5"/>
          <bitfield caption="Endpoint 6 Interrupt" mask="0x00040000" name="PEP_6"/>
          <bitfield caption="Endpoint 7 Interrupt" mask="0x00080000" name="PEP_7"/>
          <bitfield caption="Endpoint 8 Interrupt" mask="0x00100000" name="PEP_8"/>
          <bitfield caption="Endpoint 9 Interrupt" mask="0x00200000" name="PEP_9"/>
          <bitfield caption="DMA Channel 1 Interrupt" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt" mask="0x40000000" name="DMA_6"/>
        </register>
        <register caption="Device Global Interrupt Clear Register" name="UOTGHS_DEVICR" offset="0x0008" rw="W" size="4">
          <bitfield caption="Suspend Interrupt Clear" mask="0x00000001" name="SUSPC"/>
          <bitfield caption="Micro Start of Frame Interrupt Clear" mask="0x00000002" name="MSOFC"/>
          <bitfield caption="Start of Frame Interrupt Clear" mask="0x00000004" name="SOFC"/>
          <bitfield caption="End of Reset Interrupt Clear" mask="0x00000008" name="EORSTC"/>
          <bitfield caption="Wake-Up Interrupt Clear" mask="0x00000010" name="WAKEUPC"/>
          <bitfield caption="End of Resume Interrupt Clear" mask="0x00000020" name="EORSMC"/>
          <bitfield caption="Upstream Resume Interrupt Clear" mask="0x00000040" name="UPRSMC"/>
        </register>
