avrxml/AS6-Devices-XML/ATSAM3X4E.xml
        <register caption="Device Endpoint Configuration Register (n = 0) 7" name="UOTGHS_DEVEPTCFG7" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transaction per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="UOTGHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 8" name="UOTGHS_DEVEPTCFG8" offset="0x120" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transaction per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="UOTGHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 9" name="UOTGHS_DEVEPTCFG9" offset="0x124" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transaction per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="UOTGHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 0" name="UOTGHS_DEVEPTISR0" offset="0x130" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="Underflow Interrupt" mask="0x00000004" name="UNDERFI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="High bandwidth isochronous IN Underflow Error Interrupt" mask="0x00000008" name="HBISOINERRI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt" mask="0x00000010" name="HBISOFLUSHI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="CRC Error Interrupt" mask="0x00000040" name="CRCERRI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="High-bandwidth isochronous OUT endpoint transaction error Interrupt" mask="0x00000400" name="ERRORTRANS"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 1" name="UOTGHS_DEVEPTISR1" offset="0x134" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="Underflow Interrupt" mask="0x00000004" name="UNDERFI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="High bandwidth isochronous IN Underflow Error Interrupt" mask="0x00000008" name="HBISOINERRI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt" mask="0x00000010" name="HBISOFLUSHI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="CRC Error Interrupt" mask="0x00000040" name="CRCERRI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="High-bandwidth isochronous OUT endpoint transaction error Interrupt" mask="0x00000400" name="ERRORTRANS"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
