avrxml/AS6-Devices-XML/ATSAM3X4E.xml
        <register caption="Device DMA Channel Status Register (n = 5)" name="UOTGHS_DEVDMASTATUS5" offset="0x35C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="Device DMA Channel Next Descriptor Address Register (n = 6)" name="UOTGHS_DEVDMANXTDSC6" offset="0x360" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="Device DMA Channel Address Register (n = 6)" name="UOTGHS_DEVDMAADDRESS6" offset="0x364" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="Device DMA Channel Control Register (n = 6)" name="UOTGHS_DEVDMACONTROL6" offset="0x368" rw="RW" size="4">
          <bitfield caption="Channel Enable Command" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable Command" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable Control" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable Control" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="Device DMA Channel Status Register (n = 6)" name="UOTGHS_DEVDMASTATUS6" offset="0x36C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="Device DMA Channel Next Descriptor Address Register (n = 7)" name="UOTGHS_DEVDMANXTDSC7" offset="0x370" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="Device DMA Channel Address Register (n = 7)" name="UOTGHS_DEVDMAADDRESS7" offset="0x374" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="Device DMA Channel Control Register (n = 7)" name="UOTGHS_DEVDMACONTROL7" offset="0x378" rw="RW" size="4">
          <bitfield caption="Channel Enable Command" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable Command" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable Control" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable Control" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="Device DMA Channel Status Register (n = 7)" name="UOTGHS_DEVDMASTATUS7" offset="0x37C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="Host General Control Register" name="UOTGHS_HSTCTRL" offset="0x0400" rw="RW" size="4">
          <bitfield caption="Start of Frame Generation Enable" mask="0x00000100" name="SOFE"/>
          <bitfield caption="Send USB Reset" mask="0x00000200" name="RESET"/>
          <bitfield caption="Send USB Resume" mask="0x00000400" name="RESUME"/>
          <bitfield caption="Mode Configuration" mask="0x00003000" name="SPDCONF" values="UOTGHS_HSTCTRL__SPDCONF"/>
        </register>
        <register caption="Host Global Interrupt Status Register" name="UOTGHS_HSTISR" offset="0x0404" rw="R" size="4">
          <bitfield caption="Device Connection Interrupt" mask="0x00000001" name="DCONNI"/>
          <bitfield caption="Device Disconnection Interrupt" mask="0x00000002" name="DDISCI"/>
          <bitfield caption="USB Reset Sent Interrupt" mask="0x00000004" name="RSTI"/>
          <bitfield caption="Downstream Resume Sent Interrupt" mask="0x00000008" name="RSMEDI"/>
          <bitfield caption="Upstream Resume Received Interrupt" mask="0x00000010" name="RXRSMI"/>
          <bitfield caption="Host Start of Frame Interrupt" mask="0x00000020" name="HSOFI"/>
          <bitfield caption="Host Wake-Up Interrupt" mask="0x00000040" name="HWUPI"/>
          <bitfield caption="Pipe 0 Interrupt" mask="0x00000100" name="PEP_0"/>
          <bitfield caption="Pipe 1 Interrupt" mask="0x00000200" name="PEP_1"/>
          <bitfield caption="Pipe 2 Interrupt" mask="0x00000400" name="PEP_2"/>
          <bitfield caption="Pipe 3 Interrupt" mask="0x00000800" name="PEP_3"/>
          <bitfield caption="Pipe 4 Interrupt" mask="0x00001000" name="PEP_4"/>
          <bitfield caption="Pipe 5 Interrupt" mask="0x00002000" name="PEP_5"/>
          <bitfield caption="Pipe 6 Interrupt" mask="0x00004000" name="PEP_6"/>
          <bitfield caption="Pipe 7 Interrupt" mask="0x00008000" name="PEP_7"/>
          <bitfield caption="Pipe 8 Interrupt" mask="0x00010000" name="PEP_8"/>
          <bitfield caption="Pipe 9 Interrupt" mask="0x00020000" name="PEP_9"/>
          <bitfield caption="DMA Channel 1 Interrupt" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt" mask="0x40000000" name="DMA_6"/>
        </register>
