avrxml/AS6-Devices-XML/ATSAM3X4E.xml
        <register caption="Host Pipe Enable Register (n = 0) 1" name="UOTGHS_HSTPIPIER1" offset="0x5F4" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINES"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTES"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFIES"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRES"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIES"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIES"/>
          <bitfield caption="Number of Busy Banks Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMAS"/>
          <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
        </register>
        <register caption="Host Pipe Enable Register (n = 0) 2" name="UOTGHS_HSTPIPIER2" offset="0x5F8" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINES"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTES"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFIES"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRES"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIES"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIES"/>
          <bitfield caption="Number of Busy Banks Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMAS"/>
          <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
        </register>
        <register caption="Host Pipe Enable Register (n = 0) 3" name="UOTGHS_HSTPIPIER3" offset="0x5FC" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINES"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTES"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFIES"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRES"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIES"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIES"/>
          <bitfield caption="Number of Busy Banks Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMAS"/>
          <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
        </register>
        <register caption="Host Pipe Enable Register (n = 0) 4" name="UOTGHS_HSTPIPIER4" offset="0x600" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINES"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTES"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFIES"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRES"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIES"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIES"/>
          <bitfield caption="Number of Busy Banks Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMAS"/>
          <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
        </register>
        <register caption="Host Pipe Enable Register (n = 0) 5" name="UOTGHS_HSTPIPIER5" offset="0x604" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINES"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTES"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFIES"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRES"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIES"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIES"/>
          <bitfield caption="Number of Busy Banks Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMAS"/>
          <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
        </register>
        <register caption="Host Pipe Enable Register (n = 0) 6" name="UOTGHS_HSTPIPIER6" offset="0x608" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINES"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTES"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFIES"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRES"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIES"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIES"/>
          <bitfield caption="Number of Busy Banks Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMAS"/>
          <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
        </register>
